brew "bat"
brew "delta"
brew "fd"
brew "git-interactive-rebase-tool"
brew "gping"
brew "grex"
brew "htop"
brew "hyperfine"
brew "lazygit"
brew "lsd"
brew "navi"
brew "procs"
brew "pueue"
brew "ripgrep"
brew "skktools"
brew "tealdeer"
brew "tree"
