brew "asdf"
brew "bat"
brew "bash"
brew "fish"
brew "ghq"
brew "git"
brew "lsd"
brew "node"
brew "skktools"
brew "tmux"
brew "xonsh"
brew "zoxide"

if OS.mac?
  tap "homebrew/cask"
  tap "homebrew/cask-fonts"

  brew "gnu-sed"
  brew "gnu-time"
  brew "macvim"
  brew "mas"

  cask "alacritty"
  cask "firefox"
  cask "font-cica"
  cask "google-chrome"
  cask "google-japanese-ime"
  cask "menumeters"
  cask "scroll-reverser"
  cask "zoom"

  mas "slack", id: 803453959
  mas "the unarchiver", id: 425424353
else
  brew "vim"
end
