tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/core"
brew "asdf"
brew "bash"
brew "bat"
brew "delta"
brew "fd"
brew "fish"
brew "gcc"
brew "ghq"
brew "git"
brew "git-interactive-rebase-tool"
brew "go"
brew "gping"
brew "grex"
brew "heroku/brew/heroku"
brew "htop"
brew "hyperfine"
brew "lazydocker"
brew "lazygit"
brew "lsd"
brew "luajit"
brew "navi"
brew "neovim", args: ["HEAD"]
brew "node"
brew "procs"
brew "pueue"
brew "ripgrep"
brew "skktools"
brew "tealdeer"
brew "tmux"
brew "topgrade"
brew "tree"
brew "whalebrew"
brew "zsh"

if OS.mac?
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    brew "mas"

    brew "gnu-sed"
    brew "gnu-time"
    brew "macvim"

    cask "alacritty"
    cask "discord"
    cask "docker"
    cask "font-cica"
    cask "google-chrome"
    cask "google-japanese-ime"
    cask "iterm2"
    cask "menumeters"
    cask "scroll-reverser"
end
